#### 📖 Terraform Plan ('infra/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.ai_search.azurerm_cosmosdb_sql_role_assignment.search_to_cosmos_data_reader must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "search_to_cosmos_data_reader" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-services-cms-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-services-cms/sqlRoleAssignments/6e33a700-1c00-6cff-6d6c-3d0aa6904f02" -> (known after apply)
      ~ name                = "6e33a700-1c00-6cff-6d6c-3d0aa6904f02" -> (known after apply)
      ~ principal_id        = "a0ebb97a-6a26-4faf-a620-83a0a170ed12" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.ai_search.azurerm_cosmosdb_sql_role_assignment.search_to_cosmos_data_reader_db must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "search_to_cosmos_data_reader_db" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-services-cms-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-services-cms/sqlRoleAssignments/2d895edc-8baf-f231-9ee2-2efea28622a2" -> (known after apply)
      ~ name                = "2d895edc-8baf-f231-9ee2-2efea28622a2" -> (known after apply)
      ~ principal_id        = "a0ebb97a-6a26-4faf-a620-83a0a170ed12" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.ai_search.azurerm_cosmosdb_sql_role_assignment.search_to_cosmos_data_reader_db_colls must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "search_to_cosmos_data_reader_db_colls" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-services-cms-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-services-cms/sqlRoleAssignments/22cad04a-8d05-913a-58f5-c2a2def04e2a" -> (known after apply)
      ~ name                = "22cad04a-8d05-913a-58f5-c2a2def04e2a" -> (known after apply)
      ~ principal_id        = "a0ebb97a-6a26-4faf-a620-83a0a170ed12" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.ai_search.azurerm_private_endpoint.srch must be replaced
-/+ resource "azurerm_private_endpoint" "srch" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-pep-01" -> (known after apply)
        name                     = "io-p-itn-svc-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-svc-pep-01.nic.51212014-34d9-407f-9300-4550f53c52ac"
              - name = "io-p-itn-svc-pep-01.nic.51212014-34d9-407f-9300-4550f53c52ac"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-pep-01/privateDnsZoneGroups/io-p-itn-svc-dns-zone-group-01/privateDnsZoneConfigs/privatelink.search.windows.net"
              - name                = "privatelink.search.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.search.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "io-p-itn-svc-srch-01.privatelink.search.windows.net"
                      - ip_addresses = [
                          - "10.20.2.4",
                        ]
                      - name         = "io-p-itn-svc-srch-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-pep-01/privateDnsZoneGroups/io-p-itn-svc-dns-zone-group-01" -> (known after apply)
            name                 = "io-p-itn-svc-dns-zone-group-01"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-svc-srch-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.4" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.ai_search.azurerm_role_assignment.developers_group_to_ai_search_reader must be replaced
-/+ resource "azurerm_role_assignment" "developers_group_to_ai_search_reader" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01/providers/Microsoft.Authorization/roleAssignments/2115ff52-6d4d-3469-258b-754f1a717f22" -> (known after apply)
      ~ name                             = "2115ff52-6d4d-3469-258b-754f1a717f22" -> (known after apply)
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/1407120a-92aa-4202-b7e9-c0e197c71c8f" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ai_search.azurerm_role_assignment.search_to_cosmos_account_reader must be replaced
-/+ resource "azurerm_role_assignment" "search_to_cosmos_account_reader" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-services-cms-rg/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-services-cms/providers/Microsoft.Authorization/roleAssignments/a6e22f76-2b8a-3fda-b087-9ed2c14a30d8" -> (known after apply)
      ~ name                             = "a6e22f76-2b8a-3fda-b087-9ed2c14a30d8" -> (known after apply)
      ~ principal_id                     = "a0ebb97a-6a26-4faf-a620-83a0a170ed12" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/fbdf93bf-df7d-467e-a4d2-9458aa1360c8" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ai_search.azurerm_search_service.srch must be replaced
-/+ resource "azurerm_search_service" "srch" {
      - allowed_ips                              = [] -> null
      ~ id                                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01" -> (known after apply)
        name                                     = "io-p-itn-svc-srch-01"
      ~ primary_key                              = (sensitive value)
      ~ query_keys                               = [
          - {
              - key  = "aJJwO3EvM4wg8CvDifstqaorSnxw7Gi14L7FPCfYuiAzSeCdnfcM"
              - name = ""
            },
        ] -> (known after apply)
      ~ secondary_key                            = (sensitive value)
      ~ sku                                      = "basic" -> "standard" # forces replacement
        tags                                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (9 unchanged attributes hidden)

      ~ identity {
          ~ principal_id = "a0ebb97a-6a26-4faf-a620-83a0a170ed12" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.ai_search.azurerm_search_shared_private_link_service.srch_to_cosmos must be replaced
-/+ resource "azurerm_search_shared_private_link_service" "srch_to_cosmos" {
      ~ id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01/sharedPrivateLinkResources/io-p-itn-svc-spl-01" -> (known after apply)
        name               = "io-p-itn-svc-spl-01"
      ~ search_service_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01" # forces replacement -> (known after apply) # forces replacement
      ~ status             = "Approved" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.function_app.azurerm_role_assignment.app_be_fn_staging_slot_to_ai_search_reader must be replaced
-/+ resource "azurerm_role_assignment" "app_be_fn_staging_slot_to_ai_search_reader" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01/providers/Microsoft.Authorization/roleAssignments/5de419d7-03d0-f0f6-acd3-772787f2aba9" -> (known after apply)
      ~ name                             = "5de419d7-03d0-f0f6-acd3-772787f2aba9" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/1407120a-92aa-4202-b7e9-c0e197c71c8f" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.function_app.azurerm_role_assignment.app_be_fn_to_ai_search_reader must be replaced
-/+ resource "azurerm_role_assignment" "app_be_fn_to_ai_search_reader" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01/providers/Microsoft.Authorization/roleAssignments/38fa1add-1832-34c1-5d28-708b9032cea7" -> (known after apply)
      ~ name                             = "38fa1add-1832-34c1-5d28-708b9032cea7" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/1407120a-92aa-4202-b7e9-c0e197c71c8f" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.function_app.module.app_be_fn.data.azurerm_function_app_host_keys.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_function_app_host_keys" "this" {
      + blobs_extension_key             = (sensitive value)
      + default_function_key            = (sensitive value)
      + durabletask_extension_key       = (sensitive value)
      + event_grid_extension_config_key = (sensitive value)
      + event_grid_extension_key        = (sensitive value)
      + id                              = (known after apply)
      + name                            = "io-p-itn-svc-app-be-fn-01"
      + primary_key                     = (sensitive value)
      + resource_group_name             = "io-p-itn-svc-rg-01"
      + signalr_extension_key           = (sensitive value)
      + webpubsub_extension_key         = (sensitive value)
    }

  # module.function_app.module.app_be_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-fn-01"
        name                                           = "io-p-itn-svc-app-be-fn-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Enti & Servizi"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (28 unchanged attributes hidden)

      ~ site_config {
            # (27 unchanged attributes hidden)

          - ip_restriction {
              - action      = "Allow" -> null
              - description = "Giamma Temp" -> null
              - headers     = [] -> null
              - ip_address  = "94.34.137.164/32" -> null
              - name        = "Giamma" -> null
              - priority    = 65000 -> null
            }

            # (4 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 10 to add, 1 to change, 10 to destroy.

Error: unexpected response code '403': 

  with module.ai_search.restapi_object.organizations_datasource,
  on ../_modules/ai_search/organizations.tf line 1, in resource "restapi_object" "organizations_datasource":
   1: resource "restapi_object" "organizations_datasource" {


Error: unexpected response code '403': 

  with module.ai_search.restapi_object.organizations_index_01,
  on ../_modules/ai_search/organizations.tf line 24, in resource "restapi_object" "organizations_index_01":
  24: resource "restapi_object" "organizations_index_01" {


Error: unexpected response code '403': 

  with module.ai_search.restapi_object.services_publication_datasource,
  on ../_modules/ai_search/services.tf line 1, in resource "restapi_object" "services_publication_datasource":
   1: resource "restapi_object" "services_publication_datasource" {


Error: unexpected response code '403': 

  with module.ai_search.restapi_object.services_lifecycle_datasource,
  on ../_modules/ai_search/services.tf line 29, in resource "restapi_object" "services_lifecycle_datasource":
  29: resource "restapi_object" "services_lifecycle_datasource" {


Error: unexpected response code '403': 

  with module.ai_search.restapi_object.services_index_01,
  on ../_modules/ai_search/services.tf line 57, in resource "restapi_object" "services_index_01":
  57: resource "restapi_object" "services_index_01" {

::error::Terraform exited with code 1.
```

</details>
